export const ApiErrors = {
    // ===========================
    // Общие ошибки
    // ===========================

    INTERNAL_SERVER_ERROR: 'Внутренняя ошибка сервера',
    TOKEN_NOT_PROVIDED: 'Токен не предоставлен',
    TOKEN_IS_EXPIRED: 'Токен недействителен или истёк',
    ACCESS_DENIED: 'Недостаточно прав для выполнения действия',
    AUTH_SERVICE_UNAVAILABLE: 'Сервис аутентификации недоступен',

    // ===========================
    // Пользователи
    // ===========================

    USER_NOT_FOUND: 'Пользователь не найден или не активен',
    USER_ALREADY_EXIST: 'Пользователь уже зарегистрирован',
    USER_NOT_FOUND_BY_PARAM: (param: string) => `Пользователь по параметру "${param}" не найден`,

    // ===========================
    // Организации
    // ===========================

    ORG_IS_ALREADY_EXIST: 'Организация уже зарегистрирована',
    ORG_STATUS_IS_PENDING: 'Организация находится на проверке',
    ORG_NOT_FOUND_OR_INACTIVE:
        'Данному пользователю не принадлежит ни одна организация или она не активна',
    ORG_UPDATE_ERROR: 'Ошибка обновления организации',

    // ===========================
    // Тарифные планы
    // ===========================

    TARIF_PLAN_NOT_FOUND: 'Выбранный тарифный план не найден',

    // ===========================
    // Точки (локации)
    // ===========================

    LOCATION_IS_ALREADY_EXIST: (name: string) => `Точка "${name}" уже зарегистрирована`,

    // ===========================
    // Тикеты
    // ===========================

    TICKET_NOT_FOUND: 'Заявка не найдена',
    TICKET_TYPE_NOT_FOUND: 'Тип заявки не найден',
    TICKET_ALREADY_EXIST: 'Тикет уже существует. Ожидайте',
    TICKET_ERROR_CREATE: 'Ошибка создания заявки',
    TICKET_ERROR_UPDATE: 'Ошибка обновления заявки',
} as const;

export type ApiErrors = Extract<(typeof ApiErrors)[keyof typeof ApiErrors], string>;
